0xsmirk/mcu_cmsis_svd/Spansion/MB9BFD1xT.svd
        <!-- REGISTER "VTR" -->
        <register>
          <name>VTR</name>
          <description>VLAN TAG Register</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0001FFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "ETV" -->
            <field>
              <name>ETV</name>
              <description>Enable 12-Bit VLAN Tag Comparison</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "VL" -->
            <field>
              <name>VL</name>
              <description>VLAN Tag Identifier</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "RWFFR" -->
        <register>
          <name>RWFFR</name>
          <description>Remote Wake-up Frame Filter Register</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "RWFFR31" -->
            <field>
              <name>RWFFR31</name>
              <description>Remote Wake-up Frame Filter Register</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PMTR" -->
        <register>
          <name>PMTR</name>
          <description>PMT Register</description>
          <addressOffset>0x2C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x80000267</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "RWFFRPR" -->
            <field>
              <name>RWFFRPR</name>
              <description>Remote Wake-up Frame Filter Register Pointer Reset</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "GU" -->
            <field>
              <name>GU</name>
              <description>Global Unicast</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "WPR" -->
            <field>
              <name>WPR</name>
              <description>Wake Up Frame Receive</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MPR" -->
            <field>
              <name>MPR</name>
              <description>Magic Packet Received</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "WFE" -->
            <field>
              <name>WFE</name>
              <description>Wake-Up Frame Enable</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MPE" -->
            <field>
              <name>MPE</name>
              <description>Magic Packet Enable</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PD" -->
            <field>
              <name>PD</name>
              <description>Power Down</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "LPICSR" -->
        <register>
          <name>LPICSR</name>
          <description>LPI Control and Status Register</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000F030F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "LPITXA" -->
            <field>
              <name>LPITXA</name>
              <description>LPI TX Automate</description>
              <lsb>19</lsb>
              <msb>19</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PLSEN" -->
            <field>
              <name>PLSEN</name>
              <description>PHY Link Status Enable</description>
              <lsb>18</lsb>
              <msb>18</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PLS" -->
            <field>
              <name>PLS</name>
              <description>PHY Link Status</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LPIEN" -->
            <field>
              <name>LPIEN</name>
              <description>LPI Enable</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RLPIST" -->
            <field>
              <name>RLPIST</name>
              <description>Receive LPI State</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TLPIST" -->
            <field>
              <name>TLPIST</name>
              <description>Transmit LPI State</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "RLPIEX" -->
            <field>
              <name>RLPIEX</name>
              <description>Receive LPI Exit</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "RLPIEN" -->
            <field>
              <name>RLPIEN</name>
              <description>Receive LPI Entry</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TLPIEX" -->
            <field>
              <name>TLPIEX</name>
              <description>Transmit LPI Exit</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TLPIEN" -->
            <field>
              <name>TLPIEN</name>
              <description>Transmit LPI Entry</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "LPITCR" -->
        <register>
          <name>LPITCR</name>
          <description>LPI Timers Control Register</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x03E80000</resetValue>
          <resetMask>0x03FFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "LIT" -->
            <field>
              <name>LIT</name>
              <description>LPI LS TIMER</description>
              <lsb>16</lsb>
              <msb>25</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TWT" -->
            <field>
              <name>TWT</name>
              <description>LPI TW TIMER</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "ISR" -->
        <register>
          <name>ISR</name>
          <description>Interrupt Status Register</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000006F9</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "LPIIS" -->
            <field>
              <name>LPIIS</name>
              <description>LPI Interrupt Status</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TSIS" -->
            <field>
              <name>TSIS</name>
              <description>Time Stamp Interrupt Status</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "COIS" -->
            <field>
              <name>COIS</name>
              <description>MMC Receive Checksum Offload Interrupt Status</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TIS" -->
            <field>
              <name>TIS</name>
              <description>MMC Transmit Interrupt Status</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "RIS" -->
            <field>
              <name>RIS</name>
              <description>MMC Receive Interrupt Status</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MIS" -->
            <field>
              <name>MIS</name>
              <description>MMC Interrupt Status</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "PIS" -->
            <field>
              <name>PIS</name>
              <description>PMT Interrupt Status</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "RGIS" -->
            <field>
              <name>RGIS</name>
              <description>RGMII Interrupt Status</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IMR" -->
        <register>
          <name>IMR</name>
          <description>Interrupt Mask Register</description>
          <addressOffset>0x3C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000069</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "LPIIM" -->
            <field>
              <name>LPIIM</name>
              <description>LPI Interrupt Mask</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TSIM" -->
            <field>
              <name>TSIM</name>
              <description>Time Stamp Interrupt Mask</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PIM" -->
            <field>
              <name>PIM</name>
              <description>PMT Interrupt Mask</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RGIM" -->
            <field>
              <name>RGIM</name>
              <description>RGMII Interrupt Mask</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
