0xsmirk/mcu_cmsis_svd/Spansion/MB9BFD1xT.svd
        <!-- REGISTER "SR" -->
        <register>
          <name>SR</name>
          <description>Status Register</description>
          <addressOffset>0x1014</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x7FFFE7FF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "GLPII" -->
            <field>
              <name>GLPII</name>
              <description>GMAC LPI Interrupt</description>
              <lsb>30</lsb>
              <msb>30</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TTI" -->
            <field>
              <name>TTI</name>
              <description>Time-Stamp Trigger Interrupt</description>
              <lsb>29</lsb>
              <msb>29</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "GPI" -->
            <field>
              <name>GPI</name>
              <description>GMAC PMT Interrupt</description>
              <lsb>28</lsb>
              <msb>28</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "GMI" -->
            <field>
              <name>GMI</name>
              <description>GMAC MMC Interrupt</description>
              <lsb>27</lsb>
              <msb>27</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "GLI" -->
            <field>
              <name>GLI</name>
              <description>GMAC Line interface Interrupt</description>
              <lsb>26</lsb>
              <msb>26</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "EB" -->
            <field>
              <name>EB</name>
              <description>Error Bits</description>
              <lsb>23</lsb>
              <msb>25</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TS" -->
            <field>
              <name>TS</name>
              <description>Transmit Process State</description>
              <lsb>20</lsb>
              <msb>22</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "RS" -->
            <field>
              <name>RS</name>
              <description>Receive Process State</description>
              <lsb>17</lsb>
              <msb>19</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "NIS" -->
            <field>
              <name>NIS</name>
              <description>Normal Interrupt Summary</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "AIS" -->
            <field>
              <name>AIS</name>
              <description>Abnormal Interrupt Summary</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ERI" -->
            <field>
              <name>ERI</name>
              <description>Early Receive Interrupt</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "FBI" -->
            <field>
              <name>FBI</name>
              <description>Fatal Bus Error Interrupt</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ETI" -->
            <field>
              <name>ETI</name>
              <description>Early Transmit Interrupt</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "RWT" -->
            <field>
              <name>RWT</name>
              <description>Receive Watchdog Timeout</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "RPS" -->
            <field>
              <name>RPS</name>
              <description>Receive process Stopped</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "RU" -->
            <field>
              <name>RU</name>
              <description>Receive Buffer Unavailable</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "RI" -->
            <field>
              <name>RI</name>
              <description>Receive Interrupt</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "UNF" -->
            <field>
              <name>UNF</name>
              <description>Transmit underflow</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "OVF" -->
            <field>
              <name>OVF</name>
              <description>Receive Overflow</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TJT" -->
            <field>
              <name>TJT</name>
              <description>Transmit Jabber Timeout</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TU" -->
            <field>
              <name>TU</name>
              <description>Transmit Buffer Unavailable</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TPS" -->
            <field>
              <name>TPS</name>
              <description>Transmit Process Stopped</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TI" -->
            <field>
              <name>TI</name>
              <description>Transmit Interrupt</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "OMR" -->
        <register>
          <name>OMR</name>
          <description>Operation Mode Register</description>
          <addressOffset>0x1018</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0731E0DE</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "DT" -->
            <field>
              <name>DT</name>
              <description>Disable Dropping of TCP/IP Checksum Error Frames</description>
              <lsb>26</lsb>
              <msb>26</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RSF" -->
            <field>
              <name>RSF</name>
              <description>Receive Store and Forward</description>
              <lsb>25</lsb>
              <msb>25</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DFF" -->
            <field>
              <name>DFF</name>
              <description>Disable Flushing of Received Frames</description>
              <lsb>24</lsb>
              <msb>24</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TSF" -->
            <field>
              <name>TSF</name>
              <description>Transmit Store Forward</description>
              <lsb>21</lsb>
              <msb>21</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FTF" -->
            <field>
              <name>FTF</name>
              <description>Flush Transmit FIFO</description>
              <lsb>20</lsb>
              <msb>20</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TTC" -->
            <field>
              <name>TTC</name>
              <description>Transmit Threshold Control</description>
              <lsb>14</lsb>
              <msb>16</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ST" -->
            <field>
              <name>ST</name>
              <description>Start/Stop Transmission Command</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FEF" -->
            <field>
              <name>FEF</name>
              <description>Forward Error Frames</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FUF" -->
            <field>
              <name>FUF</name>
              <description>Forward Undersized Good Frames</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RTC" -->
            <field>
              <name>RTC</name>
              <description>Receive Threshold Control</description>
              <lsb>3</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "OSF" -->
            <field>
              <name>OSF</name>
              <description>Operate on Second Frame</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SR" -->
            <field>
              <name>SR</name>
              <description>Start/Stop Receive</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IER" -->
        <register>
          <name>IER</name>
          <description>Interrupt Enable Register</description>
          <addressOffset>0x101C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0001E7FF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "NIE" -->
            <field>
              <name>NIE</name>
              <description>Normal Interrupt Summary Enable</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AIE" -->
            <field>
              <name>AIE</name>
              <description>Abnormal Interrupt Summary Enable</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ERE" -->
            <field>
              <name>ERE</name>
              <description>Early Receive Interrupt Enable</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FBE" -->
            <field>
              <name>FBE</name>
              <description>Fatal Bus Error Enable</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ETE" -->
            <field>
              <name>ETE</name>
              <description>Early Transmit Interrupt Enable</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RWE" -->
            <field>
              <name>RWE</name>
              <description>Receive Watchdog Timeout Enable</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RSE" -->
            <field>
              <name>RSE</name>
              <description>Receive Process Stopped Enable</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RUE" -->
            <field>
              <name>RUE</name>
              <description>Receive Buffer Unavailable Enable</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RIE" -->
            <field>
              <name>RIE</name>
              <description>Receive Interrupt Enable</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UNE" -->
            <field>
              <name>UNE</name>
              <description>Transmit underflow Enable</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "OVE" -->
            <field>
              <name>OVE</name>
              <description>Receive Overflow Enable</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TJE" -->
            <field>
              <name>TJE</name>
              <description>Transmit Jabber Timeout</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TUE" -->
            <field>
              <name>TUE</name>
              <description>Transmit Buffer Unavailable</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TSE" -->
            <field>
              <name>TSE</name>
              <description>Transmit Process Stopped</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIE" -->
            <field>
              <name>TIE</name>
              <description>Transmit Interrupt</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "MFBOCR" -->
        <register>
          <name>MFBOCR</name>
          <description>Missed Frame and Buffer Overflow Counter Register</description>
          <addressOffset>0x1020</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x1FFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "ONMFF" -->
            <field>
              <name>ONMFF</name>
              <description>Overflow NMFF</description>
              <lsb>28</lsb>
              <msb>28</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "NMFF" -->
            <field>
              <name>NMFF</name>
              <description>Number of Missed frame by Ethernet-MAC</description>
              <lsb>17</lsb>
              <msb>27</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ONMFH" -->
            <field>
              <name>ONMFH</name>
              <description>Overflow NMFH</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "NMFH" -->
            <field>
              <name>NMFH</name>
              <description>Number of Missed frame by HOST</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "RIWTR" -->
        <register>
          <name>RIWTR</name>
          <description>Receive Interrupt Watchdog Timer Register</description>
          <addressOffset>0x1024</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "RIWT" -->
            <field>
              <name>RIWT</name>
              <description>RI Watchdog Timer count</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "AHBSR" -->
        <register>
          <name>AHBSR</name>
          <description>AHB Status Register</description>
          <addressOffset>0x102C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "AHBS" -->
            <field>
              <name>AHBS</name>
              <description>AHB Status</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "CHTDR" -->
        <register>
          <name>CHTDR</name>
          <description>Current Host Transmit Descriptor Register</description>
          <addressOffset>0x1048</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "HTDAP" -->
            <field>
              <name>HTDAP</name>
              <description>Host Transmit Descriptor Address Pointer</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "CHRDR" -->
        <register>
          <name>CHRDR</name>
          <description>Current Host Receive Descriptor Register</description>
          <addressOffset>0x104C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "HRDAP" -->
            <field>
              <name>HRDAP</name>
              <description>Host Receive Descriptor Address Pointer</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
